# ConfusingPadByElementsInAnotherDesignOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..ConfusingPadByElementsInAnotherDesignOption Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
A pad in a Design Option cannot be hosted by a topography in another Design Option [--if you continue it will not be added to the design option set].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConfusingPadByElementsInAnotherDesignOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConfusingPadByElementsInAnotherDesignOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConfusingPadByElementsInAnotherDesignOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace